Процедура ПередЗаписью(Отказ) 
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ Документ.УП
	|ГДЕ НП = &НП И Семестр = &Семестр И Стандарт = &Стандарт 
	|");     
	Запрос.УстановитьПараметр("НП", ЭтотОбъект.НП);
	Запрос.УстановитьПараметр("Семестр", ЭтотОбъект.Семестр);
	Запрос.УстановитьПараметр("Стандарт", ЭтотОбъект.Стандарт);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат[0].Количество > 0 Тогда
		Сообщить("Для этого НП на этот семестр уже есть документ по этому стандарту");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры