Функция ПолучитьЧислоСтудентовГрупп(Группы)
	ВсегоСтудентов = 0;	
	Для каждого Группа из Группы Цикл
		ВсегоСтудентов = ВсегоСтудентов + 
			Справочники
				.Группа
				.НайтиПоНаименованию(Группа)
				.КоличествоСтудентов;
	КонецЦикла;		
	Возврат ВсегоСтудентов;	
КонецФункции 

Функция ПолучитьГруппуПоНаименованию(Группа) 
	Возврат Справочники
				.Группа
				.НайтиПоНаименованию(Группа)
				.Ссылка;
КонецФункции

Функция НайтиРасписаниеПоКоду(Код, Поле)
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1 " + Поле + " 
	|	КАК Значение
	|ИЗ РегистрСведений.Расписание
	|ГДЕ Код = &Код
	|");
	Запрос.УстановитьПараметр("Код", Код); 
	Результат = Запрос.Выполнить().Выгрузить();  
	Возврат Результат[0].Значение;      
КонецФункции

Процедура ПередЗаписью(Отказ) 
	Группы = НайтиРасписаниеПоКоду(ЭтотОбъект.Расписание, "Группы");
	МаксимумСтудентов = ПолучитьЧислоСтудентовГрупп(СтрРазделить(Группы, " "));
	Если ЭтотОбъект.КолвоПрисутствующих > МаксимумСтудентов Тогда
		ТекстСообщения = "Количество присутствующих превышает сумму студентов по группам! 
		| Максимальное значение - " + МаксимумСтудентов;
		Сообщить(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли; 
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, Режим)
	Дисциплина = НайтиРасписаниеПоКоду(ЭтотОбъект.Расписание, "Дисциплина");
	Семестр = НайтиРасписаниеПоКоду(ЭтотОбъект.Расписание, "Семестр");
    Группы = НайтиРасписаниеПоКоду(ЭтотОбъект.Расписание, "Группы");
	
	Движения.ЧасыПоДис.Записывать = Истина;
	Для каждого Группа из СтрРазделить(Группы, " ", Ложь) Цикл
		Движение = Движения.ЧасыПоДис.Добавить();
		Движение.Период = Дата;
		Движение.Дисциплина = Дисциплина;
		Движение.Группа = ПолучитьГруппуПоНаименованию(Группа); 
		Движение.Семестр = Семестр;
		Движение.Время = ЭтотОбъект.Длительность;
	КонецЦикла;   
КонецПроцедуры

