Функция ПолучитьПредполагаемыйТип(Строка) Экспорт
	НачалоСтроки = Лев(Строка, 2);
	
	Если СтрСравнить(НачалоСтроки, "ле") = 0 Тогда
		Возврат Перечисления.ТипАудитории["Лекционная"];
		
	ИначеЕсли СтрСравнить(НачалоСтроки, "ла") = 0 Тогда
		Возврат Перечисления.ТипАудитории["Лаборатория"];
		
	ИначеЕсли СтрСравнить(НачалоСтроки, "об") = 0
			ИЛИ СтрСравнить(НачалоСтроки, "се") = 0 Тогда
		Возврат Перечисления.ТипАудитории["Обычная"];
		
	ИначеЕсли СтрСравнить(НачалоСтроки, "ко") = 0 Тогда
		Возврат Перечисления.ТипАудитории["Компьютерная"];
		
	Иначе
		Возврат Ложь;
		
	КонецЕсли;
КонецФункции