Функция ЯвляетсяЧислом(Значение) Экспорт
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Истина
	Иначе
		Если ТипЗнч(Значение) = Тип("Строка") Тогда
			Если Значение = "" Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;

		Попытка
			Р = Число(Значение);
		Исключение
			Возврат Ложь;
		КонецПопытки;
			Возврат Истина;
	КонецЕсли;
КонецФункции

Функция ЭтоУникальныйНомер(Номер)
	Запрос = Новый Запрос("
	|ВЫБРАТЬ 
	|	КОЛИЧЕСТВО(*) КАК К
	|ИЗ Справочник.Аудитория
	|ГДЕ Наименование = &Наименование
	|");
	Запрос.УстановитьПараметр("Наименование", Номер); 
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат[0].К < 2 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Процедура ПриЗаписи(Отказ)
	Номер = ЭтотОбъект.Наименование; 
	Шаблон = "Наименование аудитории заполняется по форме:
	|1 - Номер корпуса (1 - 9)
	|2 - Этаж (1 - 9)
	|3,4 - Номер аудитории
	|";
	Если 
		НЕ ЯвляетсяЧислом(Номер)
		ИЛИ СтрДлина(Номер) <> 4 
		ИЛИ СтрНайти(Номер, ".")
	Тогда 
		Сообщить(Шаблон);
		Отказ = Истина;
	КонецЕсли;
	Если Не ЭтоУникальныйНомер(Номер) Тогда
		Сообщить("Аудитория с номером " + Номер + " уже существует!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры